mapping *allqiuqian = ({
([
        "id":1,
        "title"        :"姜公封相",
        "doc"        :"灵 签 求 得 第 一 枝 , 龙 虎 风 云 际 会 时\n一 旦 凌 霄 扬 自 乐 , 任 君 来 往 赴 瑶 池",
        "type"        :"上上签",
        "love_fate"        :"爱 情 生 活 幸 福 ， 适 婚 人 士 要 把 握 时 机 。" 
]),
([
        "id":2,
        "title"        :"误入桃源",
        "doc"        :"桃 源 竞 斗 千 红 紫 , 一 叶 渔 舟 误 入 津\n枯 木 逢 春 尽 发 新 , 花 香 叶 茂 蝶 来 频",  
        "type"        :"上吉签",
        "love_fate"        :"未 婚 者 可 望 遇 到 心 上 人 ， 已 婚 者 亦 生 活 和 谐 ， 但 要 防 婚 外 情 。" 
]),
([
        "id":3,
        "title"        :"鲁班开山",
        "doc"        :"牛 山 之 木 皆 常 美 , 独 惜 斧 工 尽 伐 他\n大 器 大 材 无 足 用 , 规 矩 不 准 怎 为 槎",
        "type"        :"中平签",
        "love_fate"        :"不 宜 嫁 娶。" 
]),
([
        "id":4,
        "title"        :"董永遇仙",
        "doc"        :"调 雏 紫 燕 在 檐 前 , 对 语 呢 喃 近 午 天\n或 往 或 来 低 复 起 , 有 时 剪 破 绿 杨 烟",
        "type"        :"中吉签",
        "love_fate"        :"爱 情 尚 算 如 意 ， 婚 姻 亦 美 满 。" 
]),
([
        "id":5,
        "title"        :"韩氏惜花",
        "doc"        :"东 园 昨 夜 狂 风 急 , 万 紫 千 红 亦 尽 倾\n幸 有 惜 花 人 早 起 , 培 回 根 本 复 栽 生",
        "type"        :"中吉签",
        "love_fate"        :"爱 情 尚 算 如 意 ， 婚 姻 亦 美 满 。" 
]),
([
        "id":6,
        "title"        :"游滕王阁",
        "doc"        :"一 片 孤 帆 万 里 回 , 管 弦 呕 哑 且 停 杯\n如 云 胜 友 谈 风 月 , 畅 叙 幽 情 极 乐 哉",
        "type"        :"上吉签",
        "love_fate"        :"夫 妻 恩 爱 ， 未 婚 者 年 底 有 机 会 遇 上 意 中 人 。" 
]),
([
        "id":7,
        "title"        :"仁贵归家",
        "doc"        :"秋 来 征 雁 向 南 归 , 红 叶 纷 纷 满 院 飞\n碪 捣 城 头 声 切 耳 , 江 枫 如 火 在 渔 矶",
        "type"        :"中吉签",
        "love_fate"        :"夫 妻 间 会 有 冲 撞 ， 未 婚 者 不 易 在 今 年 结 婚  。" 
]),
([
        "id":8,
        "title"        :"崔子弑君",
        "doc"        :"鸣 鸠 争 夺 鹊 巢 居 , 宾 主 参 差 意 不 舒\n满 岭 乔 松 萝 茑 附 , 且 猜 诗 语 是 何 如",
        "type"        :"下下签",
        "love_fate"        :"婚 姻 与 爱 情 皆 受 尽 考 验 ， 还 要 提 防 第 三 者 出 现 。" 
]),
([
        "id":9,
        "title"        :"陶潜賞菊",
        "doc"        :"瑤 琴 一 曲 奏 新 腔 , 明 月 清 風 枕 簟 涼\n咸 集 嘉 賓 同 賞 菊 , 或 歌 或 舞 或 飛 觴",
        "type"        :"上吉签",
        "love_fate"        :"有 情 人 終 成 眷 屬 ； 已 婚 者 夫 唱 婦 隨 。" 
]),
([
        "id":10,
        "title"        :"苏秦不笫",
        "doc"        :"一 轮 月 镜 挂 空 中 , 偶 被 浮 云 障 滠 重\n玉 匣 何 时 光 气 吐 , 谁 人 借 我 一 狂 风",
        "type"        :"中平签",
        "love_fate"        :"夫 妻 会 有 小 磨 擦 ， 万 事 要 以 和 为 贵 ； 有 情 人 今 年 则 不 宜 结 婚 。" 
]),
([
        "id":11,
        "title"        :"漢帝賞柳",
        "doc"        :"楊 柳 垂 堤 鎖 綠 煙 , 日 長 三 起 又 三 眠\n往 來 紫 燕 紛 飛 舞 , 嬝 娜 迎 風 倩 我 憐",
        "type"        :"上吉签",
        "love_fate"        :"夫 妻 感 情 和 洽 ， 未 婚 者 則 宜 今 年 多 加 留 心 意 中 人 的 出 现 。" 
]),
([
        "id":12,
        "title"        :"太白捞月",
        "doc"        :"蜃 楼 海 市 幻 无 边 , 万 丈 擎 空 接 上 天\n或 被 狂 风 忽 吹 散 , 有 时 仍 聚 结 青 烟",
        "type"        :"下下签",
        "love_fate"        :"夫 妻 间 会 经 常 发 生 磨 擦 ， 最 紧 要 互 相 信 任 。" 
]),
([
        "id":13,
        "title"        :"踏雪寻梅",
        "doc"        :"岭 南 初 放 一 枝 梅 , 片 片 晶 莹 入 酒 杯\n却 遇 骑 驴 人 早 至 , 儿 童 背 负 占 春 魁",
        "type"        :"中平签",
        "love_fate"        :"可 能 有 第 三 者 介 入 ， 因 此 要 留 心 小 人 ； 未 婚 者 宜 於 秋 冬 结 婚 。" 
]),
([
        "id":14,
        "title"        :"陶潜醉酒",
        "doc"        :"為 愛 幽 閒 多 種 竹 , 買 春 賞 雨 在 茅 屋\n醉 時 臥 倒 杏 花 邊 , 怕 聽 鶯 兒 驚 夢 熟",
        "type"        :"中吉签",
        "love_fate"        :"不 論 夫 妻 或 情 侶 ， 總 會 有 一 些 小 磨 擦 ， 但 無 礙 於 雙 方 感 情 。" 
]),
([
        "id":15,
        "title"        :"明皇遊月",
        "doc"        :"仙 槎 一 葉 泛 中 流 , 月 殿 蟾 宮 任 爾 遊\n盈 耳 霓 裳 聲 漸 歇 , 酒 詩 吟 飲 幾 時 休",
        "type"        :"上吉签",
        "love_fate"        :"夫 妻 生 活 協 調 ， 可 望 得 到 昇 華 ； 情 侶 是 時 間 拉 埋 天 窗 ， 尤 其 在 秋 季 以 後 。" 
]),
([
        "id":16,
        "title"        :"皇叔遇贤",
        "doc"        :"天 边 鸦 背 夕 阳 回 , 陇 外 儿 童 跨 犊 来\n羌 笛 频 吹 声 切 耳 , 短 长 腔 调 乐 何 哉",
        "type"        :"中吉签",
        "love_fate"        :"夫 妇 间 只 要 随 遇 而 安 ， 便 能 恩 爱 和 洽 ； 未 婚 情 侣 则 不 宜 太 早 结 婚 。" 
]),
([
        "id":17,
        "title"        :"月下追贤",
        "doc"        :"秋 水 蒹 葭 白 露 盈 , 盈 庭 月 色 浸 阶 清\n清 风 吹 动 马 铃 响 , 响 接 晨 钟 不 断 声",
        "type"        :"中吉签",
        "love_fate"        :"可 能 因 第 三 者 之 出 现 而 生 醋 意 ， 切 记 彼 此 要 信 任 。" 
]),
([
        "id":18,
        "title"        :"杜鵑啼血",
        "doc"        :"杜 鵑 啼 血 淚 悲 聲 , 聲 怨 霜 寒 夢 乍 驚\n驚 動 異 鄉 為 異 客 , 客 心 更 觸 故 園 情",
        "type"        :"下下签",
        "love_fate"        :"夫 妻 間 經 常 發 生 磨 擦 ， 爭 吵 越 頻 密 ， 恶 运 更 會 接 踵 而 來 ； 因 此 最 緊 要 忍 。" 
]),
([
        "id":19,
        "title"        :"伏羲画卦",
        "doc"        :"乾 卦 三 连 号 太 阳 , 潜 龙 勿 用 第 一 章\n其 中 爻 象 能 参 透 , 百 福 骈 臻 大 吉 昌",
        "type"        :"中吉签",
        "love_fate"        :"只 要 检 点 个 人 言 行 ， 就 能 和 谐 共 处 。" 
]),
([
        "id":20,
        "title"        :"雪梅招親",
        "doc"        :"天 上 仙 花 難 問 種 , 人 間 塵 事 幾 多 更\n前 程 已 註 公 私 簿 , 罰 賞 分 明 濁 與 清",
        "type"        :"中平签",
        "love_fate"        :"姻 緣 早 由 天 注 定 ， 只 要 大 家 以 禮 相 待 ， 定 能 融 洽 共 處 。" 
]),
([
        "id":21,
        "title"        :"则天赏花",
        "doc"        :"天 外 红 霞 如 抹 锦 , 槛 边 桃 杏 斗 新 装\n盈 眸 烟 熳 谁 居 首 , 美 酒 频 斟 且 酌 量",
        "type"        :"中吉签",
        "love_fate"        :"宜 趁 春 天 订 婚 ， 明 年 初 冬 共 谐 连 理 。" 
]),
([
        "id":22,
        "title"        :"陈妙思春",
        "doc"        :"秋 水 依 人 各 一 方 , 天 南 地 北 恨 偏 长\n相 思 试 问 凭 谁 寄 , 不 尽 凄 凉 狂 断 肠",
        "type"        :"下下签",
        "love_fate"        :"与 情 人 有 分 手 的 危 机 ， 不 宜 嫁 娶 。" 
]),
([
        "id":23,
        "title"        :"盧 生 夢",
        "doc"        :"邯 鄲 一 夢 幻 無 邊 , 數 載 身 榮 是 熟 眠\n換 卻 锦 衣 歸 故 里 , 睡 醒 還 記 在 心 田",
        "type"        :"中平签",
        "love_fate"        :"他 ∕ 她 對 你 若 即 若 離 ， 端 端 的 也 會 無 緣 無 故 分 手 。" 
]),
([
        "id":24,
        "title"        :"居易叹情",
        "doc"        :"诗 酒 琴 棋 可 解 愁 , 座 中 无 客 乐 难 休\n或 弹 或 唱 谁 知 美 , 冷 饮 虽 多 亦 是 忧",
        "type"        :"下下签",
        "love_fate"        :"你 的 阴 晴 不 定 ， 很 难 吸 引 异 性 。" 
]),
([
        "id":25,
        "title"        :"洪武登基",
        "doc"        :" 群 山 扰 扰 朝 中 岳 , 有 似 为 臣 列 鹄 班\n拱 立 两 行 齐 整 肃 , 自 居 此 地 岂 无 欢",
        "type"        :"上吉签",
        "love_fate"        :"夫 妻 和 睦 ， 生 育 大 计 可 实 现 。" 
]),
([
        "id":26,
        "title"        :"徐庶归国",
        "doc"        :"花 影 迟 迟 侵 砌 上 , 遥 知 月 镜 挂 长 空\n忽 闻 鹤 泪 声 凄 切 , 早 买 归 舟 返 里 中",
        "type"        :"中平签",
        "love_fate"        :"谈 婚 论 嫁 尽 量 留 待 明 年 。" 
]),
([
        "id":27,
        "title"        :"越王復國",
        "doc"        :"天 晴 粉 蜨 翻 衣 曬 , 又 看 庭 前 蟻 陣 掛\n隊 伍 整 齊 趨 或 退 , 時 開 時 合 思 何 隹",
        "type"        :"中平签",
        "love_fate"        :"千 挑 萬 選 ， 還 是 平 易 近 人 的 對 象 最 適 合 你 。" 
]),
([
        "id":28,
        "title"        :"江上琵琶",
        "doc"        :"船 泊 潯 陽 月 夜 天 , 琵 琶 一 曲 動 人 憐\n相 思 兩 地 憑 誰 寄 , 白 雪 摧 人 上 鬢 巔",
        "type"        :"中平签",
        "love_fate"        :"其 貌 不 揚 的 人 ， 會 是 對 你 關 懷 備 至 的 伴 侶。" 
]),
([
        "id":29,
        "title"        :"张翰思鲈",
        "doc"        :" 鲈 鱼 作 脍 菊 花 黄 , 美 酒 盈 樽 迎 晚 凉\n泛 棹 正 当 潮 上 候 , 这 般 佳 景 乐 无 央",
        "type"        :"中吉签",
        "love_fate"        :"爱 情 突 飞 猛 进 。" 
]),
([
        "id":30,
        "title"        :"贵妃自缢",
        "doc"        :"倾 国 倾 城 媚 百 生 , 六 宫 粉 黛 尽 无 名\n马 嵬 山 下 魂 飞 去 , 至 令 明 皇 长 恨 情",
        "type"        :"下下签",
        "love_fate"        :"爱 情 要 受 过 考 验 才 会 开 花 结 果 。" 
]),
([
        "id":31,
        "title"        :"中興遇險",
        "doc"        :"狂 風 驟 雨 打 船 篷 , 溪 泮 桃 花 盡 落 紅\n驚 醒 漁 翁 春 夢 熟 , 持 篙 撐 去 失 西 東",
        "type"        :"下下签",
        "love_fate"        :"感 情 進 退 兩 難 。" 
]),
([
        "id":32,
        "title"        :"蘇武牧羊",
        "doc"        :"十 九 年 前 海 上 辛 , 節 旄 彫 敗 逐 沙 塵\n餐 毛 嚼 雪 誰 憐 我 , 惟 有 羊 兒 作 伴 群",
        "type"        :"中平签",
        "love_fate"        :"是 愛 情 備 受 考 驗 的 一 年 。 婚 事 過 了 這 個 冬 天 再 說 。" 
]),
([
        "id":33,
        "title"        :"孔明识曹",
        "doc"        :"曹 操 虽 有 深 谋 计 , 智 慧 难 瞒 诸 葛 候\n试 看 东 风 都 可 借 , 更 能 流 马 木 成 牛",
        "type"        :"中平签",
        "love_fate"        :"婚 事 最 好 延 迟 到 明 年 。" 
]),
([
        "id":34,
        "title"        :"大舜耕山",
        "doc"        :"大 舜 虽 耕 在 历 山 , 心 常 孝 顺 两 嚣 顽\n田 中 之 象 同 家 象 , 善 恶 分 明 即 此 间",
        "type"        :"中吉签",
        "love_fate"        :"和 对 象 情 投 意 合 ， 宜 婚 嫁 。" 
]),
([
        "id":35,
        "title"        :"三藏取经",
        "doc"        :"天 将 降 任 此 其 人 , 筋 骨 先 劳 苦 彼 身\n莫 谓 隹 景 来 可 易 , 贫 穷 富 贵 有 前 因",
        "type"        :"中吉签",
        "love_fate"        :"秋 後 可 能 缔 结 好 姻 缘 。" 
]),
([
        "id":36,
        "title"        :"平貴回窑",
        "doc"        :"此 事 真 如 到 岸 船 , 何 憂 風 水 不 相 全\n舉 頭 便 見 前 村 落 , 屋 角 斜 陽 爨 已 煙",
        "type"        :"中吉签",
        "love_fate"        :"擇 偶 不 應 計 較 其 家 勢 。" 
]),
([
        "id":37,
        "title"        :"畅遊赤壁",
        "doc"        :"月 夜 秋 江 下 釣 鰲 , 魚 形 恰 似 四 腮 鱸\n家 藏 舊 釀 堪 盈 斗 , 與 友 飛 觴 盡 倒 壺",
        "type"        :"上吉签",
        "love_fate"        :"秋 天 是 花 月 佳 期 。" 
]),
([
        "id":38,
        "title"        :"陱潜辭官",
        "doc"        :"歸 去 來 兮 仕 官 閒 , 室 堪 容 膝 亦 為 安\n南 窗 寄 傲 談 詩 酒 , 倚 杖 徘 徊 飽 看 山",
        "type"        :"中吉签",
        "love_fate"        :"愛 情 順 其 自 然 ， 急 不 來 。" 
]),
([
        "id":39,
        "title"        :"夷齊讓國",
        "doc"        :"夷 齊 不 忍 食 周 粟 , 兄 弟 心 甘 採 蕨 餐\n讓 國 名 應 垂 萬 古 , 可 憐 餓 倒 首 陽 山",
        "type"        :"中吉签",
        "love_fate"        :"今 年 最 好 打 消 結 婚 念 頭 。" 
]),
([
        "id":40,
        "title"        :"伯牙碎琴",
        "doc"        :"人 世 知 音 能 有 幾 , 碎 琴 都 為 子 期 忘\n墳 前 洒 盡 千 行 淚 , 隔 別 陰 陽 各 一 方",
        "type"        :"下下签",
        "love_fate"        :"戀 愛 變 幻 無 常 ， 結 婚 還 是 太 早 。" 
]),
([
        "id":41,
        "title"        :"张骞获宝",
        "doc"        :"浮 槎 月 夜 到 天 河 , 曾 见 天 姬 织 锦 梭\n石 得 支 机 人 罕 识 , 那 知 此 宝 出 云 窝",
        "type"        :"中吉签",
        "love_fate"        :"美 满 姻 缘 垂 手 可 得 。" 
]),
([
        "id":42,
        "title"        :"计獻貂嬋",
        "doc"        :"月 明 散 步 到 花 欄 , 無 策 焉 能 勦 滅 奸\n幸 有 貂 嬋 思 定 國 , 英 雄 難 過 美 人 關",
        "type"        :"中吉签",
        "love_fate"        :"「 男 追 女 隔 重 山 ， 女 追 男 隔 張 紙 」 是 今 年 寫 照 。" 
]),
([
        "id":43,
        "title"        :"韩公被贬",
        "doc"        :" 祗 因 直 谏 怒 天 颜 , 昼 夜 难 离 在 马 鞍\n主 仆 奔 忙 神 亦 倦 , 更 加 雪 重 拥 蓝 关",
        "type"        :"下下签",
        "love_fate"        :"感 情 发 展 迂 回 。" 
]),
([
        "id":44,
        "title"        :"天宝评花",
        "doc"        :"满 园 春 色 斗 新 年 , 意 似 争 姘 夺 国 香\n到 底 是 谁 居 丽 首 , 牡 丹 艳 冠 百 花 场",
        "type"        :"中吉签",
        "love_fate"        :"爱 情 开 花 结 果 ， 成 就 一 段 好 姻 缘 。" 
]),
([
        "id":45,
        "title"        :"王质遇仙",
        "doc"        :"采 樵 不 意 到 云 天 , 闲 看 敲 棋 二 老 仙\n柯 烂 方 思 归 故 里 , 山 中 七 日 世 千 年",
        "type"        :"中平签",
        "love_fate"        :"沐 浴 在 爱 河 中 ， 不 知 时 光 流 逝 。" 
]),
([
        "id":46,
        "title"        :"左慈戲曹",
        "doc"        :"黃 金 數 盒 獻 曹 公 , 剖 看 原 來 肉 盡 空\n怒 動 奸 雄 揮 鐵 斧 , 奔 忙 身 入 萬 羊 中",
        "type"        :"下下签",
        "love_fate"        :"戀 愛 變 幻 無 常 ， 結 婚 還 是 太 早 。" 
]),
([
        "id":47,
        "title"        :"鲁肅索荊",
        "doc"        :"遙 遙 千 里 來 西 蜀 , 欲 問 荊 州 那 日 還\n劉 備 不 言 聲 淚 下 , 自 思 無 策 轉 吳 間",
        "type"        :"下下签",
        "love_fate"        :"常 有 小 爭 執 ， 伴 侶 可 能 失 信 於 你 。" 
]),
([
        "id":48,
        "title"        :"文君賣酒",
        "doc"        :"繡 閣 聽 琴 自 起 思 , 改 粧 夤 夜 最 歡 時\n可 憐 沽 酒 臨 邛 市 , 才 子 隹 人 兩 下 廚",
        "type"        :"中平签",
        "love_fate"        :"美 滿 良 緣 就 在 眼 前 。" 
]),
([
        "id":49,
        "title"        :"相如题桥",
        "doc"        :"十 年 窗 下 苦 功 成 , 有 志 难 舒 愿 不 轻\n试 看 题 桥 十 三 字 , 生 平 心 誓 碓 锺 情",
        "type"        :"中吉签",
        "love_fate"        :"找 到 志 同 道 合 的 对 象 ， 应 主 动 向 对 方 求 婚 。" 
]),
([
        "id":50,
        "title"        :"伍员出关",
        "doc"        :"记 得 当 年 伍 子 胥 , 潜 奔 难 渡 幸 逢 渔\n欲 将 宝 剑 相 持 赠 , 大 义 交 朋 却 不 辞",
        "type"        :"中吉签",
        "love_fate"        :"若 遇 上 投 缘 的 人 ， 便 拿 出 诚 意 。" 
]),
([
        "id":51,
        "title"        :"成王封弟",
        "doc"        :"剪 桐 虽 是 作 儿 嬉 , 封 弟 成 圭 语 不 移\n何 以 伪 为 成 实 事 , 言 因 无 戏 故 如 斯",
        "type"        :"中平签",
        "love_fate"        :"情 人 可 能 爱 耍 小 性 子 ， 大 家 互 相 忍 让 。" 
]),
([
        "id":52,
        "title"        :"盘古开天",
        "doc"        :"上 清 下 浊 成 天 地 , 清 浊 相 凝 便 作 人\n尔 欲 签 求 明 白 事 , 且 将 三 等 细 分 明",
        "type"        :"中平签",
        "love_fate"        :"约 会 谈 情 无 妨 ， 订 婚 、 结 婚 未 免 太 早 。" 
]),
([
        "id":53,
        "title"        :"煖客孟尝",
        "doc"        :"珠 履 三 千 客 孟 尝 , 谁 人 识 得 有 鹰 扬\n其 中 弹 铗 归 来 者 , 便 是 英 雄 志 莫 当",
        "type"        :"中吉签",
        "love_fate"        :"婚 期 在 望 ， 秋 後 更 宜 嫁 娶 。" 
]),
([
        "id":54,
        "title"        :"庄周梦蝶",
        "doc"        :"庄 子 酣 眠 成 □ 梦 , 翩 翻 飞 入 百 花 丛\n天 香 采 得 归 来 後 , 犹 在 高 床 暖 枕 中",
        "type"        :"中平签",
        "love_fate"        :"有 桃 花 运 ， 但 婚 期 犹 未 在 望 。" 
]),
([
        "id":55,
        "title"        :"隐之投扇",
        "doc"        :"浦 号 沈 香 遗 旧 恨 , 渡 江 犹 忆 古 人 心\n可 怜 当 日 辞 官 去 , 虽 有 馨 留 不 易 寻",
        "type"        :"中平签",
        "love_fate"        :"缘 份 未 临 ， 难 以 碰 到 惬 意 的 对 象 ， 遇 上 也 难 有 结 果 。" 
]),
([
        "id":56,
        "title"        :"呂祖飞劍",
        "doc"        :"安 知 此 劍 不 成 龍 , 見 水 都 應 出 袖 中\n他 日 飛 騰 千 萬 里 , 上 空 妖 嬌 有 雲 從",
        "type"        :"中吉签",
        "love_fate"        :"以 诚 相 待 ， 雙 方 感 情 踏 入 成 熟 的 階 段 ， 婚 期 將 近 。" 
]),
([
        "id":57,
        "title"        :"独占花魁",
        "doc"        :"小 楼 春 雨 声 初 歇 , 彳 亍 街 头 履 不 停\n忽 听 卖 花 人 入 巷 , 一 枝 买 得 慢 慢 行",
        "type"        :"中吉签",
        "love_fate"        :"邂 逅 意 中 人 ， 不 妨 主 动 进 求 ， 但 不 可 急 进 。" 
]),
([
        "id":58,
        "title"        :"蹇叔哭师",
        "doc"        :"秦 师 大 败 在 肴 山 , 三 帅 皆 擒 尽 放 还\n蹇 叔 谏 言 因 不 听 , 倒 戈 舍 甲 返 秦 间",
        "type"        :"下下签",
        "love_fate"        :"小 病 容 易 变 大 病 ， 需 及 早 治 病 。" 
]),
([
        "id":59,
        "title"        :"西施澣紗",
        "doc"        :"涴 溪 紗 女 美 無 雙 , 媚 至 吳 王 國 破 亡\n最 惱 東 施 效 顰 笑 , 山 雞 豈 可 勝 鸞 凰",
        "type"        :"下下签",
        "love_fate"        :"有 磨 擦 ， 愛 情 基 礎 不 穩 。" 
]),
([
        "id":60,
        "title"        :"醉辭和番",
        "doc"        :"和 番 醉 筆 似 雲 煙 , 日 在 長 安 酒 店 眠\n倘 遇 唐 皇 頒 令 召 , 重 呼 不 上 木 蘭 船",
        "type"        :"中平签",
        "love_fate"        :"多 次 示 愛 ， 不 代 表 真 诚 ， 仍 需 考 驗 。" 
]),
([
        "id":61,
        "title"        :"金牌招将",
        "doc"        :" 十 二 金 牌 速 召 回 , 奸 雄 设 计 几 时 灰\n可 怜 一 旦 功 劳 散 , 老 少 扶 车 不 断 哀",
        "type"        :"下下签",
        "love_fate"        :"爱 情 生 隙 嫌 ， 可 能 有 第 三 者 。" 
]),
([
        "id":62,
        "title"        :"孔子守道",
        "doc"        :"美 玉 於 斯 韫 匮 藏 , 休 求 善 价 费 商 量\n沽 之 亦 可 随 相 待 , 此 物 何 需 自 看 常",
        "type"        :"中平签",
        "love_fate"        :"感 情 更 进 一 步 ， 结 婚 还 未 是 时 候 。" 
]),
([
        "id":63,
        "title"        :"乐道安贫",
        "doc"        :"陋 巷 箪 瓢 不 足 愁 , 旁 人 见 此 甚 为 忧\n不 知 乐 道 忘 贫 乏 , 亚 圣 芳 名 万 古 留",
        "type"        :"中吉签",
        "love_fate"        :"有 情 人 终 成 眷 属 ， 且 是 一 个 欣 赏 你 的 人 。" 
]),
([
        "id":64,
        "title"        :"之反殿師",
        "doc"        :"奔 殿 須 知 上 古 人 , 入 門 策 馬 不 誇 能\n敗 師 誰 肯 甘 從 後 , 託 謂 嗚 聰 畏 苦 辛",
        "type"        :"中吉签",
        "love_fate"        :"愛 情 路 不 平 坦 ， 爭 吵 常 有 。" 
]),
([
        "id":65,
        "title"        :"井底藏妃",
        "doc"        :"隋 灭 陈 时 戟 伐 纷 , 都 因 妖 媚 闭 明 君\n东 奔 西 赴 无 藏 息 , 胭 脂 井 里 隐 玉 人",
        "type"        :"下下签",
        "love_fate"        :"异 性 朋 友 殷 勤 招 待 最 要 小 心 。" 
]),
([
        "id":66,
        "title"        :"羲之会贤",
        "doc"        :"兰 亭 雅 会 众 群 贤 , 曲 水 流 觞 舍 箸 弦\n天 朗 气 清 风 惠 畅 , 茂 林 修 竹 乐 怡 然",
        "type"        :"上吉签",
        "love_fate"        :"终 身 对 像 出 现 ， 将 是 一 个 善 心 人 。" 
]),
([
        "id":67,
        "title"        :"四面楚歌",
        "doc"        :"人 雖 勇 力 不 能 當 , 莫 恃 英 雄 獨 冠 場\n可 挾 泰 山 超 北 海 , 身 心 猶 貴 重 存 亡",
        "type"        :"中平签",
        "love_fate"        :"情 海 起 波 濤 ， 為 衝 動 而 結 婚 會 後 悔 。" 
]),
([
        "id":68,
        "title"        :"子牙得志",
        "doc"        :"久 抱 凌 雲 志 未 舒 , 荷 竿 渭 水 釣 遊 魚\n文 王 千 里 求 賢 士 , 滅 紂 興 周 任 意 如",
        "type"        :"中吉签",
        "love_fate"        :"情 比 金 堅 ， 結 婚 是 最 佳 選 擇 。" 
]),
([
        "id":69,
        "title"        :"韩愈祭鱼",
        "doc"        :"忠 义 存 心 官 十 载 , 年 丰 民 桨 惠 难 忘\n鳄 鱼 毒 害 都 能 息 , 祷 告 长 江 北 海 王",
        "type"        :"中吉签",
        "love_fate"        :"诚 意 能 打 动 对 方 的 心 灵 ， 结 婚 是 时 候 了 。" 
]),
([
        "id":70,
        "title"        :"塞翁失馬",
        "doc"        :"可 比 當 年 一 塞 翁 , 雖 然 失 馬 半 途 中\n不 知 禍 福 真 何 事 , 到 底 方 明 事 始 終",
        "type"        :"中平签",
        "love_fate"        :"姻 緣 由 天 定 ， 不 能 強 求 ， 得 可 能 是 失 ， 不 宜 結 婚 。" 
]),
([
        "id":71,
        "title"        :"庄周活鲋",
        "doc"        :"涸 辙 之 中 鲋 困 之 , 穷 通 自 可 卜 当 时\n若 能 引 得 西 江 水 , 他 日 成 龙 也 未 知",
        "type"        :"中下签",
        "love_fate"        :"婚 姻 只 会 加 添 烦 恼 。" 
]),
([
        "id":72,
        "title"        :"守株待兔",
        "doc"        :"兔 兒 久 待 意 如 何 , 堪 嘆 愚 人 獨 守 株\n算 是 無 能 令 我 笑 , 不 須 守 舊 自 拘 拘",
        "type"        :"中平签",
        "love_fate"        :"情 仍 無 歸 處 ， 但 對 身 邊 的 異 性 積 極 點 ， 會 有 利 將 來 的 發 展 。" 
]),
([
        "id":73,
        "title"        :"孙霖及第",
        "doc"        :"夹 道 花 香 衬 马 蹄 , 蓝 袍 改 换 锦 衣 归\n满 街 红 粉 皆 争 羡 , 翘 首 芳 名 雁 塔 题",
        "type"        :"上上签",
        "love_fate"        :"你 选 择 有 很 多 ， 挑 一 个 合 心 意 的 ， 可 以 完 成 人 生 大 事 。" 
]),
([
        "id":74,
        "title"        :"覆水难收",
        "doc"        :"回 忆 当 年 运 蹇 时 , 夫 妻 反 目 两 分 离\n名 题 雁 塔 归 来 後 , 覆 水 马 头 时 否 悲",
        "type"        :"下下签",
        "love_fate"        :"爱 情 不 是 一 条 平 坦 路 ， 感 情 有 危 机 。" 
]),
([
        "id":75,
        "title"        :"文叙戏妻",
        "doc"        :"婚 姻 岂 可 厌 家 贫 , 文 叙 夫 妻 两 拆 分\n一 旦 首 登 龙 虎 榜 , 戏 妻 楼 坠 自 身 亡",
        "type"        :"下下签",
        "love_fate"        :"爱 情 不 能 以 金 钱 衡 量 ， 别 以 金 钱 择 偶 。" 
]),
([
        "id":76,
        "title"        :"顏回守困",
        "doc"        :"人 能 樂 道 自 修 身 , 疏 水 曲 肱 豈 厭 貧\n不 義 而 富 且 貴 者 , 我 心 都 作 是 浮 雲",
        "type"        :"中平签",
        "love_fate"        :"诚 意 是 需 要 考 驗 ， 還 未 是 結 婚 時 。" 
]),
([
        "id":77,
        "title"        :"公冶入狱",
        "doc"        :"鸟 语 能 通 公 冶 长 , 南 山 有 个 虎 驮 羊\n其 身 虽 在 於 缧 □ , 到 底 非 关 自 己 殃",
        "type"        :"中平签",
        "love_fate"        :"与 家 人 作 好 心 理 的 准 备 ， 家 中 滞 运 ， 要 携 手 应 付 困 难 。" 
]),
([
        "id":78,
        "title"        :"曾点论志",
        "doc"        :"瑟 希 铿 尔 尚 留 声 , 春 暮 时 刚 春 服 成\n冠 五 六 人 童 六 七 , 无 雩 归 咏 畅 幽 情",
        "type"        :"上吉签",
        "love_fate"        :"开 朗 乐 观 的 人 是 最 适 合 你 对 象 。" 
]),
([
        "id":79,
        "title"        :"锺馗得道",
        "doc"        :"富 贵 有 如 春 梦 熟 , 世 人 何 苦 力 争 求\n任 他 秉 笏 当 朝 立 , 到 死 惟 留 土 一 杯",
        "type"        :"中平签",
        "love_fate"        :"面 前 的 只 是 短 暂 的 情 缘 ， 不 要 要 求 太 高 。" 
]),
([
        "id":80,
        "title"        :"乐广释疑",
        "doc"        :"飞 觞 对 舞 几 时 赊 , 弓 影 横 杯 误 作 蛇\n猜 透 诗 中 元 妙 诀 , 泰 来 否 极 事 无 差",
        "type"        :"中吉签",
        "love_fate"        :"第 三 者 来 在 两 人 之 间 ， 消 失 之 後 ， 便 是 嫁 娶 时 。" 
]),
([
        "id":81,
        "title"        :"子路拱雉",
        "doc"        :"山 梁 雌 雉 得 其 时 , 上 下 飞 呜 自 乐 之\n色 举 须 知 翔 後 集 , 作 声 三 嗅 过 山 欹",
        "type"        :"中吉签",
        "love_fate"        :"爱 侣 的 诺 言 能 否 实 现 ， 还 有 待 时 间 考 验 ， 不 能 轻 信 。" 
]),
([
        "id":82,
        "title"        :"孔子擊磬",
        "doc"        :"聖 人 擊 磬 在 於 衛 , 誰 料 過 門 有 荷 簣\n嗟 嘆 有 心 挽 道 窮 , 可 憐 日 月 今 將 逝",
        "type"        :"中平签",
        "love_fate"        :"情 路 崎 嶇 ， 容 易 分 手 。" 
]),
([
        "id":83,
        "title"        :"范丹問卜",
        "doc"        :"凡 塵 身 歷 幾 時 閒 , 世 事 渾 如 疊 疊 山\n既 富 尚 憂 無 貴 子 , 不 知 花 放 又 花 殘",
        "type"        :"中平签",
        "love_fate"        :"外 表 不 是 重 要 ， 選 擇 對 象 要 重 視 內 心 。" 
]),
([
        "id":84,
        "title"        :"韩信归汉",
        "doc"        :"满 腹 奇 才 志 未 冲 , 铁 鸡 难 举 意 无 容\n张 良 指 示 身 投 汉 , 项 羽 乌 江 命 自 穷",
        "type"        :"中吉签",
        "love_fate"        :"不 用 吹 嘘 自 己 的 能 力 ， 对 方 已 渐 渐 欣 赏 你 。" 
]),
([
        "id":85,
        "title"        :"劉向淂志",
        "doc"        :"太 乙 燃 藜 照 读 书 , 十 年 窗 下 苦 功 舒\n扬 眉 吐 气 袍 穿 锦 , 驷 马 高 车 拥 道 随",
        "type"        :"上吉签",
        "love_fate"        :"今 年 內 結 婚 產 子 最 佳 ， 能 有 助 运 勢 。" 
]),
([
        "id":86,
        "title"        :"侃母迎宾",
        "doc"        :"截 发 迎 宾 否 也 贫 , 贫 中 贤 妇 更 何 人\n古 今 只 有 陶 侃 母 , 所 以 名 留 万 代 闻",
        "type"        :"上吉签",
        "love_fate"        :"权 贵 可 近 ， 婚 姻 自 然 会 美 满 。" 
]),
([
        "id":87,
        "title"        :"士 龙 会 客",
        "doc"        :"会 谈 华 座 逞 英 雄 , 究 竟 谁 人 秉 大 公\n一 云 日 下 荀 呜 鹤 , 一 说 云 间 陆 士 龙",
        "type"        :"中平签",
        "love_fate"        :"好 姻 缘 要 靠 互 相 迁 就 。" 
]),
([
        "id":88,
        "title"        :"木兰从军",
        "doc"        :"替 父 从 军 胆 气 雄 , 须 眉 巾 帼 几 人 同\n以 身 报 国 忠 而 孝 , 笑 煞 当 时 众 钜 公",
        "type"        :"中吉签",
        "love_fate"        :"秋 季 之 後 良 缘 将 至 。" 
]),
([
        "id":89,
        "title"        :"季子挂剑",
        "doc"        :"他 乡 远 历 佩 鱼 肠 , 谁 料 徐 君 意 欲 将\n既 返 愿 为 相 赠 答 , 且 悬 树 下 表 情 长",
        "type"        :"下下签",
        "love_fate"        :"感 情 有 裂 缝 ， 要 尽 快 补 救 。" 
]),
([
        "id":90,
        "title"        :"红拂私奔",
        "doc"        :"细 整 残 □ 夜 欲 奔 , 座 中 李 靖 更 何 人\n那 知 虬 髯 情 锺 处 , 拔 剑 三 回 未 敢 陈",
        "type"        :"中平签",
        "love_fate"        :"第 三 者 出 现 了 ， 而 且 会 是 一 个 劲 敌 。" 
]),
([
        "id":91,
        "title"        :"月中仙子",
        "doc"        :"蟾 宮 月 殿 桂 飄 香 , 玉 篋 團 圓 萬 里 光\n六 水 三 山 歸 鏡 裡 , 無 瑕 一 片 掛 窮 蒼",
        "type"        :"上上签",
        "love_fate"        :"女 方 感 情 上 較 男 方 順 利 ， 而 且 秋 後 最 適 宜 結 婚 。" 
]),
([
        "id":92,
        "title"        :"孔子闻乐",
        "doc"        :"至 圣 周 游 列 国 行 , 在 齐 得 听 奏 韶 乐\n三 月 不 知 嘉 肉 味 , 善 哉 大 道 可 功 成",
        "type"        :"中吉签",
        "love_fate"        :"经 过 多 年 来 的 了 解 ， 现 在 是 时 间 撮 合 一 起 。" 
]),
([
        "id":93,
        "title"        :"孔子聞衛樂",
        "doc"        :"鄭 衛 之 音 不 忍 聽 , 淫 風 敗 俗 國 將 傾\n令 人 深 入 迷 津 路 , 所 奏 全 非 古 樂 聲",
        "type"        :"下下签",
        "love_fate"        :"記 緊 戴 眼 識 人 ， 尤 其 選 擇 對 象 ， 以 勤 奮 善 良 者 最 佳 。" 
]),
([
        "id":94,
        "title"        :"劉琦出奔",
        "doc"        :"一 窟 難 容 兩 虎 兒 , 乘 風 別 嶺 各 棲 之\n名 山 自 守 為 巢 穴 , 可 免 傷 殘 後 悔 遲",
        "type"        :"中平签",
        "love_fate"        :"愛 情 會 有 阻 滯 ， 與 其 爭 風 呷 醋 ， 不 如 忍 氣 退 避 。" 
]),
([
        "id":95,
        "title"        :"女娲补天",
        "doc"        :"功 勤 一 篑 可 成 山 , 由 少 而 多 莫 惮 烦\n作 事 畏 辛 今 汝 画 , 补 天 炼 石 亦 无 难",
        "type"        :"中平签",
        "love_fate"        :"为 了 证 明 对 方 的 爱 意 ， 可 进 行 多 方 面 的 考 验 ， 因 为 漫 漫 长 路 尚 在 面 前 。" 
]),
([
        "id":96,
        "title"        :"文姬思漢",
        "doc"        :"羌 笛 頻 吹 韻 更 悲 , 異 鄉 作 客 觸 歸 期\n南 來 孤 雁 如 憐 我 , 煩 寄 家 書 轉 達 知",
        "type"        :"中平签",
        "love_fate"        :"現 在 並 非 談 婚 論 嫁 的 時 候 ， 而 且 愛 情 會 遇 上 考 驗 。" 
]),
([
        "id":97,
        "title"        :"康順釣魚",
        "doc"        :"憑 欄 晚 眺 倚 南 樓 , 滿 目 風 光 景 色 幽\n一 葉 小 舟 頻 下 餌 , 漁 翁 釣 得 有 魚 不",
        "type"        :"中平签",
        "love_fate"        :"夫 妻 間 小 磨 擦 能 促 進 感 情 ， 但 適 可 而 止 ； 情 侶 間 爭 執 卻 弄 得 分 手 下 場 。" 
]),
([
        "id":98,
        "title"        :"管鲍分金",
        "doc"        :" 入 山 种 玉 嫌 田 狭 , 掘 地 寻 金 厌 客 多\n富 贵 贫 穷 天 注 定 , 世 人 何 苦 力 奔 波",
        "type"        :"中平签",
        "love_fate"        :"只 要 心 境 平 静 ， 看 淡 世 情 ， 自 然 会 身 体 健 康 。" 
]),
([
        "id":99,
        "title"        :"文公遇雪",
        "doc"        :"雪 拥 桥 头 马 不 前 , 风 狂 渔 父 莫 开 船\n水 流 花 谢 人 谁 惜 , 早 立 坚 心 志 勿 偏",
        "type"        :"中平签",
        "love_fate"        :"若 相 方 不 肯 忍 让 ， 感 情 可 会 亮 起 红 灯 ； 谈 婚 论 嫁 ， 最 好 待 冬 天 才 计 划 。" 
]),
([
        "id":100,
        "title"        :"击鼓催花",
        "doc"        :"百 花 兢 放 贺 阳 春 , 万 物 从 今 尽 转 新\n末 数 莫 言 穷 运 至 , 不 知 否 极 泰 来 频",
        "type"        :"中吉签",
        "love_fate"        :"患 难 见 真 情 ， 留 意 身 边 那 位 有 情 人 ， 彼 此 会 有 更 进 一 步 发 展 。" 
])
});

varargs mapping get_qian(string arg)
{
        int i;
        if (!arg)
                return allqiuqian[random(sizeof(allqiuqian))];
        for (i = 0;i < sizeof(allqiuqian);i++)
        {
                if (allqiuqian[i]["id"] == arg)
                        return allqiuqian[i];
        }
        return allqiuqian[random(sizeof(allqiuqian))];
}