#include <ansi.h>
inherit ROOM;

string look_duilian();

void create()
{
        set("short", "¸£ÑÏËÂ");
        set("long", @LONG
¸£ÑÏËÂÎªìø×ÚÆß×æ»³ÈÃµÄµÀ³¡£¬»³ÈÃÔøÔÚ´ËºêÑï¶ÙÎò·¨ÃÅ¡£É½ÃÅ
µÄÉÏØÒ¶î¡¸[1£»31mÌìÏÂ·¨Ôº[2£»37£»0m¡¹ÕýÊÇµ±ÄêÐ´ÕÕ£¬Á½±ßÃÅÁª¡¸[1£»37mÁù³¯¹ÅÉ²  Æß×æµÀ
³¡[2£»37£»0m¡¹×Ö¼£°þÂäÑÕÉ«¼«¹Å¡£Ö»¼ûÉ½ÃÅµÄÇ½±ßÉÏÓÐ¹ÅÈËÁô×Ö(zi)£¬Äê´ú¹Å
Ô¶£¬ÓÌÀúÀú¿É±ç¡£¸£ÑÏËÂÄÚµÄÊ¯ÖùÉÏÓÐÒ»¶ÔÁª(lian)£¬×Ö¼£Ô²Èó»Ø×ª£¬
²»Â¶»ú·æ¡£
LONG );
        set("exits", ([ 
                "southdown"  : __DIR__"shanlu9",
                "westup"     : __DIR__"sansheng",         
        ]));

        set("objects", ([
                __DIR__"npc/xiangke" : 2,
        ]));        

        set("item_desc", ([
            "zi":
HIW"\n
          Öî·å´äÉÙÖÐ·å´ä  ÎåËÂÃû¸ß´ËËÂÃû
          Ê¯Â·ÏÕÅÌá°ö°»¬  É®´°¸ßÒÐ¼ÃÁÈÃ÷
          Áè¿Õµî¸óÓÉÌìÉè  ±éµØËÉÉ¼ÊÇ×ÔÉú
          ¸üÓÐÉÏ·½ÄÑÉÏ´¦  ×ÏÌ¦ºìÞºÔ¶á¿áÉ
\n\n"NOR,
            "lian" : (: look_duilian :),

        ]));

        set("no_clean_up", 0);

	set("coor/x", -6940);
	set("coor/y", -5570);
	set("coor/z", 0);
	setup();
}


string look_duilian()
{
        return
        HIR "\n"
        "             ¡ù¡ù¡ù¡ù¡ù¡ù¡ù            ¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n"
        "             ¡ù¡ù¡ù¡ù¡ù¡ù¡ù            ¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n"
        "             ¡ù¡ù      ¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù" NOR + HIW "¡¡¸£¡¡" NOR + HIR "¡ù¡ù            ¡ù¡ù" NOR + HIW "  °ã  " NOR + HIR "¡ù¡ù\n"
        "             ¡ù¡ù¡¡ ¡¡ ¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù" NOR + HIW "  ÑÏ  " NOR + HIR "¡ù¡ù            ¡ù¡ù" NOR + HIW "  Èô  " NOR + HIR "¡ù¡ù\n"
        "             ¡ù¡ù      ¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù" NOR + HIW "  Îª  " NOR + HIR "¡ù¡ù            ¡ù¡ù" NOR + HIW "  Îª  " NOR + HIR "¡ù¡ù\n"
        "             ¡ù¡ù      ¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù" NOR + HIW "  ÄÏ  " NOR + HIR "¡ù¡ù            ¡ù¡ù" NOR + HIW "  ÀÏ  " NOR + HIR "¡ù¡ù\n"
        "             ¡ù¡ù      ¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù" NOR + HIW "  É½  " NOR + HIR "¡ù¡ù            ¡ù¡ù" NOR + HIW "  ×æ  " NOR + HIR "¡ù¡ù\n"
        "             ¡ù¡ù    ¡¡¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù" NOR + HIW "  µÚ  " NOR + HIR "¡ù¡ù            ¡ù¡ù" NOR + HIW "  ²»  " NOR + HIR "¡ù¡ù\n"
        "             ¡ù¡ù    ¡¡¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù" NOR + HIW "  Ò»  " NOR + HIR "¡ù¡ù            ¡ù¡ù" NOR + HIW "  ¶þ  " NOR + HIR "¡ù¡ù\n"
        "             ¡ù¡ù    ¡¡¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù" NOR + HIW "  ¹Å  " NOR + HIR "¡ù¡ù            ¡ù¡ù" NOR + HIW "  ·¨  " NOR + HIR "¡ù¡ù\n"
        "             ¡ù¡ù    ¡¡¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù" NOR + HIW "  É²  " NOR + HIR "¡ù¡ù            ¡ù¡ù" NOR + HIW "  ÃÅ  " NOR + HIR "¡ù¡ù\n"
        "             ¡ù¡ù    ¡¡¡ù¡ù            ¡ù¡ù      ¡ù¡ù\n"
        "             ¡ù¡ù¡ù¡ù¡ù¡ù¡ù            ¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n"
        "             ¡ù¡ù¡ù¡ù¡ù¡ù¡ù            ¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n\n" NOR;
}
