// Room:/d/welcome/regroom.c
// Updated by Lonely (08/11/2002)

#include <ansi.h>
inherit ROOM;
int do_register(string arg);

void create()
{
        set("short", "ÄàÌ¶×¢²áÊÒ");
        set("long", "\nÕâÀïÊÇĞÂÍæ¼Ò½øĞĞ×¢²áµÄµØ·½£¬ÇëÄúÊ¹ÓÃÖ¸Áî " HIC "register " NOR "¼ÓÉÏÄãµÄÍê\n"
                    "Õû¼°ÕæÊµ" HIC " email " NOR "µØÖ·½øĞĞ×¢²á¡£\n\n"
                    "    ÇëÎñ±ØÈÏÕæ×¢²áÄãµÄµç×ÓÓÊ¼şµØÖ·£¬" HIR "µç×ÓÓÊ¼şµØÖ·ÊÇ±£ÕÏÄãÒ»ÇĞ\n"
                    "È¨ÒæµÄÒÀ¾İ" NOR "£¬°üÀ¨ÄãÃÜÂëµÄ¶ªÊ§Çé¿öÏÂ£¬ÎÒÃÇÍ¨¹ıÄã×¢²áµÄĞÅÏäÀ´È·\n"
                    "ÈÏÄãµÄÉí·İºÍ¹é»¹ÄãµÄÃÜÂë¡£\n\n"

                    "ÏÖÔÚ£¬ÇëÊäÈë" HIW " register ÄúµÄemailµØÖ·\n\n" NOR);


        set("item_desc", ([
        "sign":
"\t     [1;33mÓĞ¹Øµç×ÓÓÊ¼ş×¢²áµÄ¼¸µãËµÃ÷[0m
[37m£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­[0m
Ê×ÏÈÇëÄã×ĞÏ¸¼ì²é×¢²áÃüÁîÀïÊäÈëµÄµç×ÓÓÊ¼şµØÖ·ÊÇ·ñÕıÈ·£¡

Õâ¸öÓÎÏ·µÄ×¢²á¹ı³ÌÊÇÓÉ»úÆ÷×Ô¶¯Íê³ÉµÄ£¬ÔÚÄã»¹Ã»ÓĞÀë¿ª
ÓÎÏ·µÄÊ±ºò×¢²áĞÅ¾ÍÒÑ¾­·¢³öÁË¡£Èç¹û×¢²áĞÅÎ´ÄÜÕıÈ··¢³ö
»áÌáÊ¾Äã´ÓĞÂÊäÈë×¢²áÃüÁî£¬Ö»ÓĞÕıÈ··¢³öÒÔºó²Å»á½«×¢²á
Íæ¼Ò¶ÏÏß¡£
ÄãÊÕµ½µÄÊ±¼äÊÇÓĞÄãµÄÓÊ¼ş·şÎñÌá¹©Õß¾ö¶¨µÄ£¬Èç¹ûËûÃÇ×ª
ĞÅµÄÊ±¼ä¿ì£¬Õı³£Çé¿öÏÂÄãÓ¦µ±ÔÚ[1;33m10[0mÃëÖÓÖ®ÄÚÊÕµ½¡£Ò²¾ÍÊÇ
Äã¹ØÉÏ zMud´°¿Ú´ò¿ªÓÊ¼ş³ÌĞò£¬¾ÍÓ¦µ±ÄÜÊÕµ½ÁË¡£×î³Ù[1;33m1-2[0m
¸öĞ¡Ê±Ò²Ó¦µ±ÊÕµ½¡£
ÎÒÃÇµÄÓÎÏ·¸øÍæ¼ÒÁôÁË [1;36m48[0m ¸öĞ¡Ê±µÄÊÕĞÅÊ±¼äÓ¦µ±ÊÇºÜ³ä·Ö
µÄ¡£Èç¹ûÔÚÕâ¶ÎÊ±¼äÄÚ»¹Î´ÄÜÊÕµ½ÎÒÃÇ·¢¸øÄãµÄĞÅ£¬½¨ÒéÄã
»»Ò»¸ö×ªĞÅ¿ìµÄÓÊ¼ş·şÎñÌá¹©ÕßÔÙ´ÎÉêÇë£¬»òÕßÏòÄãµÄÓÊ¼ş
·şÎñÌá¹©Õß½øĞĞ×ÉÑ¯¡£

¸ĞĞ»Äã¶ÔÕâ¸öÓÎÏ·µÄ¹Ø×¢¡£  (×¢£ºÓÊ¼ş×¢²áÖÆ¶ÈÔİ»ºÊµĞĞ)
[37m£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­[0m
                               \t\t[1;36m" + MUD_NAME + "Î×Ê¦×é[0m\n"
        ]));


        set("no_fight", 1);
        set("no_magic", 1);
        set("no_steal", 1);
        set("no_beg", 1);   
        // set("valid_startroom", 1); 
     
        setup();
}

void init()
{
        add_action("do_register", "register");
        add_action("do_register", "zhuce");
}

int do_register(string arg)
{
        object me = this_player();
        string mail;
        string msg;
        
        if (! arg|| strsrch(arg, "@") == -1 
        || sscanf(arg, "%*s@%*s.%*s") != 3 
        || strsrch(arg, ",") != -1)
                return notify_fail("µç×ÓÓÊ¼şµØÖ·±ØĞëÊÇ "
                                   "player@me.com ¸ñÊ½¡£\n");
        else
        {
                mail = arg;
                set("email", mail, me);

                msg=query("name", me)+"£¨"+query("id", me)+"£©£º\n\n";

                msg += "    »¶Ó­½øÈëÄàÌ¶µÄÊÀ½ç£¬´ÓÕâÒ»¿ÌÆğÄú½«ÓĞ»ú»áÌåÑéµ½ÆäËûMUD ÎŞ\n" +
                       "·¨´ø¸øÄúµÄ¿ìÀÖ¡£\n";
                msg += "    Èç¹ûÄúÊÇÒ»¸öÏ²»¶ÁÄÌìµÄÈË£¬ÕâÀïÓĞ¸ü¶à£¬¸üÓĞÈ¤£¬Ò²¸üÈ«ÃæµÄ\n" +
                       "emote ¿ÉÒÔÈÃÄú¾¡ÇéÏíÀÖ£¬æÒĞ¦Å­Âî£¬ÍêÈ«²»±Ø¸ºÔğÈÎ¡£\n";
                msg += "    Èç¹ûÄúÊÇÒ»¸öÏ²»¶Á·¹¦µÄÈË£¬ÕâÀïµÄÃÅÅÉÖ®¼ä½«´ïµ½×î´óÏŞ¶ÈµÄ\n" +
                       "Æ½ºâ£¬¶àÑùµÄÈÎÎñÏµÍ³¿ÉÒÔÈÃÄú±È½ÏË³ÀûµÄ³É¾ÍÒ»´ú×ÚÊ¦¡£\n";
                msg += "    Èç¹ûºÜ²»ÇÉµÄÄúÊÇÒ»¸öÀûÓûÑ¬ĞÄµÄÈË£¬ÕâÀïµÄ¹ÙÖ°ÏµÍ³Ò»¶¨¿ÉÒÔ\n" +
                       "Âú×ãÄúµ£µ±±øÂí´ó½«¾üµÄÓûÍû¡£\n";
                msg += "    Èç¹ûÄúÊÇÒ»¸ö¿ÊÍûÉú»îµÄÈË£¬Äú¿ÉÒÔÔÚÕâÀïÈ¢ÆŞÉú×Ó£¬Âò·¿µöÓã\n" +
                       "ÎªÀÖ£¬ÏíÊÜÄÇÒ»·İÊÀÍâ¸ßÈËµÄÌñ¾²Óëµ­ÑÅ¡£\n";
                msg += "    Èç¹ûÄú¶ÔMUD ÓÎÏ·¸Ğµ½ºÜÄ°Éú£¬ÎÒÃÇµÄÄàÌ¶ÖĞÓĞÍêÉÆµÄĞÂÊÖÖ¸Òı\n" +
                       "ÏµÍ³£¬²¢ÉèÓĞ×¨ÃÅµÄĞÂÈËµ¼Ê¦¶Ô¸÷Î»ĞÂÍæ¼Ò½øĞĞÖ¸µ¼¡£\n";
                msg += "    Í¬Ê±£¬ÕâÀïÑÏ¸ñ¹á³¹¡°¹«Æ½£¬¹«Õı£¬¹«¿ª¡±Áù×ÖÕæÑÔ£¬Å¬Á¦Îª¸÷\n" +
                       "Î»Íæ¼Ò´òÔìÒ»Æ¬´¿¾»µÄÓÎÏ·Ìì¿Õ¡£\n";
                msg += "    ¸ü¶àµÄÓÎÏ·ÌØÉ«Äú¿ÉÒÔ·ÃÎÊÎÒÃÇµÄÍøÕ¾www.chinesemud.org£¬»ò\n" +
                       "ÕßÖ±½Ó½øÈëÓÎÏ·ÄÚ²¿ÓÃhelpÃüÁî½øĞĞ²éÑ¯¡£Èç¹ûÄú¶ÔÎÒÃÇµÄÓÎÏ·ÓĞÈÎ\n" +
                       "ºÎÒâ¼û£¬Äú¿ÉÒÔÔÚÓÎÏ·ÄÚ²¿µÄÁôÑÔ°åÉÏÁôÑÔ£¬»òÕßÖ±½ÓµÇÂ½ÎÒÃÇµÄÂÛ\n" +
                       "Ì³bbs.chinesemud.org¡£\n";
                msg += "    ÔÙ´ÎÖÔĞÄ¸ĞĞ»Äú²ÎÓëÎÒÃÇµÄÓÎÏ·£¬ÔÚ´ËÄàÌ¶µÄÎ×Ê¦ÃÇ½«ÒÔ×î´óµÄ\n" +
                       "ÈÈÇé»Ø±¨Äú¶ÔÎÒÃÇµÄÖ§³Ö¡£\n";
                msg += "    Ğ»Ğ»£¡\n\n";

                msg += "¡¡¡¡        ¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡                ÄàÌ¶Î×Ê¦¹¤×÷Èº\n";

                /*
                if (! MAIL_D->queue_mail(me, "nitan@chinesemud.org",
                        query("email", me),"¸ĞĞ»Äú¹âÁÙÄàÌ¶ÍøÂçÓÎÏ·",msg) )
                {
                        tell_object(me, query_fail_msg());
                        tell_object(me, "·¢ËÍ×¢²áÓÊ¼şÊ§°Ü£¬Çë×¢²áÄãÕıÈ·µÄÓÊ¼şµØÖ·£¡\n");
                        return 1;
                }
                */
                
                set("registered", 1, me);
                /*
                tell_object(me, "\nÓĞÒ»·âÓÊ¼şÒÑ¸ù¾İÄúµÇ¼ÇµÄµØÖ··¢Íù\n\n" +
                                ""+HIW+query("email", me)+NOR+"\n\nÇëÄú"
                                HIG "¶ş·ÖÖÓ" NOR "ºó¼ì²éÄúµÄµç×ÓÓÊ¼şĞÅÏä¡£\n");
                */
                tell_object(me, HIR "\n×£ÄúÔÚÄàÌ¶ÍæµÄÓä¿ì£¡:)\n\n" NOR);
                message("vision", "Ö»¼û°×¹âÒ»ÉÁ£¬"+me->name()+"ÏûÊ§ÁË¡£\n", environment(me), ({me}) ); 
                // SMTP_D->send_mail(me,mail);
                me->move("/d/register/entry");
                message("vision", "ÄãºöÈ»·¢ÏÖÇ°Ãæ¶àÁËÒ»¸öÈËÓ°¡£\n", environment(me), me);
                
                return 1;
        }
}
